[Survived] EqualityOperator
src/numbers.ts:12:10
-     return n > 0;
+     return n >= 0;
Tests ran:
    positive and negative

[NoCoverage] StringLiteral
src/numbers.ts:17:10
-     return "n=" + n;
+     return "" + n;
